zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_rcc.c
/**
  ******************************************************************************
  * @file    stm32mp13xx_ll_rcc.c
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   RCC LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#if defined(USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_ll_rcc.h"
#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /*  */

/** @addtogroup STM32MP13xx_LL_Driver
  * @{
  */

#if defined(RCC)
/** @addtogroup RCC_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCC_LL_Private_Macros
  * @{
  */

#define IS_LL_RCC_I2C_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_I2C12_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_I2C3_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_I2C4_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_I2C5_CLKSOURCE))

#define IS_LL_RCC_SAI_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_SAI1_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_SAI2_CLKSOURCE))

#define IS_LL_RCC_SPI_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_SPI1_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_SPI23_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_SPI4_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_SPI5_CLKSOURCE))

#define IS_LL_RCC_UART_CLKSOURCE(__VALUE__)     (((__VALUE__) == LL_RCC_USART1_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_USART2_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_USART35_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_UART4_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_USART6_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_UART78_CLKSOURCE))

#define IS_LL_RCC_SDMMC_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_SDMMC1_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_SDMMC2_CLKSOURCE))

#define IS_LL_RCC_ETH_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_ETH1_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_ETH2_CLKSOURCE))

#define IS_LL_RCC_QSPI_CLKSOURCE(__VALUE__)     (((__VALUE__) == LL_RCC_QSPI_CLKSOURCE))

#define IS_LL_RCC_FMC_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_FMC_CLKSOURCE))

#if defined(FDCAN1)
#define IS_LL_RCC_FDCAN_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_FDCAN_CLKSOURCE))
#endif /*FDCAN1*/

#define IS_LL_RCC_SPDIFRX_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_SPDIFRX_CLKSOURCE))


#define IS_LL_RCC_USBPHY_CLKSOURCE(__VALUE__)   (((__VALUE__) == LL_RCC_USBPHY_CLKSOURCE))

#define IS_LL_RCC_USBO_CLKSOURCE(__VALUE__)     (((__VALUE__) == LL_RCC_USBO_CLKSOURCE))

#define IS_LL_RCC_RNG_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_RNG1_CLKSOURCE))

#define IS_LL_RCC_CKPER_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_CKPER_CLKSOURCE))

#define IS_LL_RCC_STGEN_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_STGEN_CLKSOURCE))

#define IS_LL_RCC_DCMIPP_CLKSOURCE(__VALUE__)   (((__VALUE__) == LL_RCC_DCMIPP_CLKSOURCE))

#define IS_LL_RCC_SAES_CLKSOURCE(__VALUE__)     (((__VALUE__) == LL_RCC_SAES_CLKSOURCE))

#if defined(DSI)
#define IS_LL_RCC_DSI_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_DSI_CLKSOURCE))
#endif /*DSI*/

#define IS_LL_RCC_ADC_CLKSOURCE(__VALUE__)      (((__VALUE__) == LL_RCC_ADC1_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_ADC2_CLKSOURCE))

#define IS_LL_RCC_LPTIM_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_LPTIM1_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_LPTIM2_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_LPTIM3_CLKSOURCE) \
                                                 || ((__VALUE__) == LL_RCC_LPTIM45_CLKSOURCE))

#define IS_LL_RCC_DFSDM_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_DFSDM_CLKSOURCE))

#define IS_LL_RCC_TIMGPRES(__VALUE__)           (((__VALUE__) == LL_RCC_TIMG1PRES) \
                                                 || ((__VALUE__) == LL_RCC_TIMG2PRES) \
                                                 || ((__VALUE__) == LL_RCC_TIMG3PRES))

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup RCC_LL_Private_Functions RCC Private functions
  * @{
  */
uint32_t RCC_GetMPUSSClockFreq(void);
uint32_t RCC_GetAXISSClockFreq(void);
uint32_t RCC_GetMLAHBSClockFreq(void);
uint32_t RCC_GetACLKClockFreq(uint32_t AXISS_Frequency);
uint32_t RCC_GetMLHCLKClockFreq(uint32_t MCUSS_Frequency);
uint32_t RCC_GetPCLK1ClockFreq(uint32_t MLHCLK_Frequency);
uint32_t RCC_GetPCLK2ClockFreq(uint32_t MLHCLK_Frequency);
uint32_t RCC_GetPCLK3ClockFreq(uint32_t MLHCLK_Frequency);
uint32_t RCC_GetPCLK4ClockFreq(uint32_t ACLK_Frequency);
uint32_t RCC_GetPCLK5ClockFreq(uint32_t ACLK_Frequency);
uint32_t RCC_GetPCLK6ClockFreq(uint32_t ACLK_Frequency);

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_LL_Exported_Functions
  * @{
  */

/** @addtogroup RCC_LL_EF_Init
  * @{
  */

/**
  * @brief  Reset the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *         - HSI  ON and used as system clock source
  *         - HSE, CSI, PLL1, PLL2, PLL3 and PLL4 OFF
  *         - AHBs and APBs bus pre-scalers set to 1.
  *         - MCO1 and MCO2 OFF
  *         - All interrupts disabled (except Wake-up from CSTOP Interrupt Enable)
  * @note   This function doesn't modify the configuration of the
  *         - Peripheral clocks
  *         - LSI, LSE and RTC clocks
  *         - HSECSS and LSECSS
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RCC registers are de-initialized
  *          - ERROR: not applicable
  */
ErrorStatus LL_RCC_DeInit(void)
{
  /* Set HSION bit */
  LL_RCC_HSI_Enable();

