zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_rcc.c
    case LL_RCC_SAI1_CLKSOURCE_PER:
    case LL_RCC_SAI2_CLKSOURCE_PER:
      sai_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    case LL_RCC_SAI1_CLKSOURCE_PLL3R:
    case LL_RCC_SAI2_CLKSOURCE_PLL3R:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        sai_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_SAI2_CLKSOURCE_SPDIF:
    /*SAI2 manages this SPDIF_CKSYMB_VALUE */
    default:
      /* Do Nothing */
      break;
  }

  return sai_frequency;
}

/**
  * @brief  Return SPIx clock frequency
  * @param  SPIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE
  * @retval SPI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSPIClockFreq(uint32_t SPIxSource)
{
  uint32_t spi_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_SPI_CLKSOURCE(SPIxSource));

  switch (LL_RCC_GetSPIClockSource(SPIxSource))
  {
    case LL_RCC_SPI1_CLKSOURCE_PLL4P:
    case LL_RCC_SPI23_CLKSOURCE_PLL4P:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        spi_frequency = PLL_Clocks.PLL_P_Frequency;
      }
      break;

    case LL_RCC_SPI1_CLKSOURCE_PLL3Q:
    case LL_RCC_SPI23_CLKSOURCE_PLL3Q:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        spi_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    /* Intended fall through */
    case LL_RCC_SPI1_CLKSOURCE_I2SCKIN:
    case LL_RCC_SPI23_CLKSOURCE_I2SCKIN:
      spi_frequency = EXTERNAL_CLOCK_VALUE;
      break;

    /* Intended fall through */
    case LL_RCC_SPI1_CLKSOURCE_PER:
    case LL_RCC_SPI23_CLKSOURCE_PER:
      spi_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    /* Intended fall through */
    case LL_RCC_SPI1_CLKSOURCE_PLL3R:
    case LL_RCC_SPI23_CLKSOURCE_PLL3R:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        spi_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    /* Intended fall through */
    case LL_RCC_SPI4_CLKSOURCE_PCLK6:
    case LL_RCC_SPI5_CLKSOURCE_PCLK6:
      spi_frequency = RCC_GetPCLK6ClockFreq(RCC_GetMLHCLKClockFreq(RCC_GetMLAHBSClockFreq()));
      break;

    /* Intended fall through */
    case LL_RCC_SPI4_CLKSOURCE_PLL4Q:
    case LL_RCC_SPI5_CLKSOURCE_PLL4Q:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        spi_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    /* Intended fall through */
    case LL_RCC_SPI4_CLKSOURCE_HSI:
    case LL_RCC_SPI5_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        spi_frequency = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_SPI4_CLKSOURCE_CSI:
    case LL_RCC_SPI5_CLKSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        spi_frequency = CSI_VALUE;
      }
      break;

    case LL_RCC_SPI4_CLKSOURCE_HSE:
    case LL_RCC_SPI5_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        spi_frequency = HSE_VALUE;
      }
      break;


    default:
      /* Do Nothing */
      break;
  }

  return spi_frequency;
}

/**
  * @brief  Return UARTx clock frequency
  * @param  UARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE
  * @retval UART clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUARTClockFreq(uint32_t UARTxSource)
{
  uint32_t uart_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_UART_CLKSOURCE(UARTxSource));

  switch (LL_RCC_GetUARTClockSource(UARTxSource))
  {
    case LL_RCC_USART1_CLKSOURCE_PCLK6:
    case LL_RCC_USART2_CLKSOURCE_PCLK6:
      uart_frequency = RCC_GetPCLK6ClockFreq(RCC_GetACLKClockFreq(RCC_GetAXISSClockFreq()));
      break;

    case LL_RCC_USART1_CLKSOURCE_PLL3Q:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        uart_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    case LL_RCC_USART1_CLKSOURCE_HSI:
    case LL_RCC_USART2_CLKSOURCE_HSI:
    case LL_RCC_UART4_CLKSOURCE_HSI:
    case LL_RCC_USART35_CLKSOURCE_HSI:
    case LL_RCC_USART6_CLKSOURCE_HSI:
    case LL_RCC_UART78_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        uart_frequency = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_USART1_CLKSOURCE_CSI:
    case LL_RCC_USART2_CLKSOURCE_CSI:
    case LL_RCC_UART4_CLKSOURCE_CSI:
    case LL_RCC_USART35_CLKSOURCE_CSI:
    case LL_RCC_USART6_CLKSOURCE_CSI:
    case LL_RCC_UART78_CLKSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        uart_frequency = CSI_VALUE;
      }
      break;

    case LL_RCC_USART1_CLKSOURCE_PLL4Q:
    case LL_RCC_USART2_CLKSOURCE_PLL4Q:
    case LL_RCC_UART4_CLKSOURCE_PLL4Q:
    case LL_RCC_USART35_CLKSOURCE_PLL4Q:
    case LL_RCC_USART6_CLKSOURCE_PLL4Q:
    case LL_RCC_UART78_CLKSOURCE_PLL4Q:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        uart_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    case LL_RCC_USART1_CLKSOURCE_HSE:
    case LL_RCC_USART2_CLKSOURCE_HSE:
    case LL_RCC_UART4_CLKSOURCE_HSE:
    case LL_RCC_USART35_CLKSOURCE_HSE:
    case LL_RCC_USART6_CLKSOURCE_HSE:
    case LL_RCC_UART78_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        uart_frequency = HSE_VALUE;
      }
      break;

