zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_rcc.c
    case LL_RCC_FDCAN_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        fdcan_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

  return fdcan_frequency;
}
#endif /*FDCAN1*/

/**
  * @brief  Return SPDIFRXx clock frequency
  * @param  SPDIFRXxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE
  * @retval SPDIFRX clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSPDIFRXClockFreq(uint32_t SPDIFRXxSource)
{
  uint32_t spdifrx_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_SPDIFRX_CLKSOURCE(SPDIFRXxSource));

  switch (LL_RCC_GetSPDIFRXClockSource(SPDIFRXxSource))
  {
    case LL_RCC_SPDIFRX_CLKSOURCE_PLL4P:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        spdifrx_frequency = PLL_Clocks.PLL_P_Frequency;
      }
      break;

    case LL_RCC_SPDIFRX_CLKSOURCE_PLL3Q:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        spdifrx_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    case LL_RCC_SPDIFRX_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        spdifrx_frequency = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

  return spdifrx_frequency;
}


/**
  * @brief  Return USBPHYx clock frequency
  * @param  USBPHYxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE
  * @retval USBPHY clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUSBPHYClockFreq(uint32_t USBPHYxSource)
{
  uint32_t usbphy_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_USBPHY_CLKSOURCE(USBPHYxSource));

  switch (LL_RCC_GetUSBPHYClockSource(USBPHYxSource))
  {
    case LL_RCC_USBPHY_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        usbphy_frequency = HSE_VALUE;
      }
      break;

    case LL_RCC_USBPHY_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        usbphy_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_USBPHY_CLKSOURCE_HSE2:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        usbphy_frequency = (HSE_VALUE / 2U);
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

  return usbphy_frequency;
}

/**
  * @brief  Return USBOx clock frequency
  * @param  USBOxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBO_CLKSOURCE
  * @retval USBO clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUSBOClockFreq(uint32_t USBOxSource)
{
  uint32_t usbo_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_USBO_CLKSOURCE(USBOxSource));

  switch (LL_RCC_GetUSBOClockSource(USBOxSource))
  {
    case LL_RCC_USBO_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        usbo_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_USBO_CLKSOURCE_PHY:
      usbo_frequency = USBO_48M_VALUE; /* rcc_ck_usbo_48m */
      break;

    default:
      /* Do Nothing */
      break;
  }

  return usbo_frequency;
}

/**
  * @brief  Return RNGx clock frequency
  * @param  RNGxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE
  * @retval RNG clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetRNGClockFreq(uint32_t RNGxSource)
{
  uint32_t rng_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_RNG_CLKSOURCE(RNGxSource));

  switch (LL_RCC_GetRNGClockSource(RNGxSource))
  {
    case LL_RCC_RNG1_CLKSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        rng_frequency = CSI_VALUE;
      }
      break;

    case LL_RCC_RNG1_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        rng_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;


    case LL_RCC_RNG1_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        rng_frequency = LSI_VALUE;
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

  return rng_frequency;
}

/**
  * @brief  Return CKPERx clock frequency
  * @param  CKPERxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE
  * @retval CKPER clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetCKPERClockFreq(uint32_t CKPERxSource)
{
  uint32_t ckper_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_CKPER_CLKSOURCE(CKPERxSource));

  switch (LL_RCC_GetCKPERClockSource(CKPERxSource))
  {
    case LL_RCC_CKPER_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        ckper_frequency = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_CKPER_CLKSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        ckper_frequency = CSI_VALUE;
      }
      break;

    case LL_RCC_CKPER_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        ckper_frequency = HSE_VALUE;
      }
      break;

    case LL_RCC_CKPER_CLKSOURCE_OFF:
    default:
      /* Do Nothing */
      break;
  }

