zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_rcc.c
  return ckper_frequency;
}

/**
  * @brief  Return STGENx clock frequency
  * @param  STGENxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE
  * @retval STGEN clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSTGENClockFreq(uint32_t STGENxSource)
{
  uint32_t stgen_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_STGEN_CLKSOURCE(STGENxSource));

  switch (LL_RCC_GetSTGENClockSource(STGENxSource))
  {
    case LL_RCC_STGEN_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        stgen_frequency = HSI_VALUE >> LL_RCC_HSI_GetDivider();
      }
      break;

    case LL_RCC_STGEN_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        stgen_frequency = HSE_VALUE;
      }
      break;

    case LL_RCC_STGEN_CLKSOURCE_OFF:
    default:
      /* Do Nothing */
      break;
  }

  return stgen_frequency;
}

/**
  * @brief  Return DCMIPPx clock frequency
  * @param  DCMIPPxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE
  * @retval DCMIPP clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetDCMIPPClockFreq(uint32_t DCMIPPxSource)
{
  uint32_t dcmipp_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_DCMIPP_CLKSOURCE(DCMIPPxSource));

  switch (LL_RCC_GetDCMIPPClockSource(DCMIPPxSource))
  {
    case LL_RCC_DCMIPP_CLKSOURCE_ACLK:
      dcmipp_frequency = RCC_GetACLKClockFreq(RCC_GetACLKClockFreq(RCC_GetAXISSClockFreq()));
      break;

    case LL_RCC_DCMIPP_CLKSOURCE_PLL2Q:
      LL_RCC_GetPLL2ClockFreq(&PLL_Clocks);
      dcmipp_frequency = PLL_Clocks.PLL_Q_Frequency;
      break;

    case LL_RCC_DCMIPP_CLKSOURCE_PLL4P:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        dcmipp_frequency = PLL_Clocks.PLL_P_Frequency;
      }
      break;

    case LL_RCC_DCMIPP_CLKSOURCE_PER:
      dcmipp_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    default:
      /* Do Nothing */
      break;
  }

  return dcmipp_frequency;
}

/**
  * @brief  Return SAESx clock frequency
  * @param  SAESxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAES_CLKSOURCE
  * @retval SAES clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSAESClockFreq(uint32_t SAESxSource)
{
  uint32_t saes_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_SAES_CLKSOURCE(SAESxSource));

  switch (LL_RCC_GetSAESClockSource(SAESxSource))
  {
    case LL_RCC_SAES_CLKSOURCE_ACLK:
      saes_frequency = RCC_GetACLKClockFreq(RCC_GetACLKClockFreq(RCC_GetAXISSClockFreq()));
      break;

    case LL_RCC_SAES_CLKSOURCE_PER:
      saes_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    case LL_RCC_SAES_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        saes_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_SAES_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        saes_frequency = LSI_VALUE;
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

  return saes_frequency;
}

#if defined(DSI)
/**
  * @brief  Return DSIx clock frequency
  * @param  DSIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DSI_CLKSOURCE
  * @retval DSI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetDSIClockFreq(uint32_t DSIxSource)
{
  uint32_t dsi_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_DSI_CLKSOURCE(DSIxSource));

  switch (LL_RCC_GetDSIClockSource(DSIxSource))
  {
    case LL_RCC_DSI_CLKSOURCE_PLL4P:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        dsi_frequency = PLL_Clocks.PLL_P_Frequency;
      }
      break;

    /* It has no sense to ask for DSIPHY frequency because it is generated
     * by DSI itself, so send back 0 as kernel frequency
     */
    case LL_RCC_DSI_CLKSOURCE_PHY:
      dsi_frequency = LL_RCC_PERIPH_FREQUENCY_NA;
      break;

    default:
      /* Do Nothing */
      break;
  }

  return dsi_frequency;
}
#endif /*DSI*/

/**
  * @brief  Return ADCx clock frequency
  * @param  ADCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE
  * @retval ADC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetADCClockFreq(uint32_t ADCxSource)
{
  uint32_t adc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_ADC_CLKSOURCE(ADCxSource));

  switch (LL_RCC_GetADCClockSource(ADCxSource))
  {
    case LL_RCC_ADC1_CLKSOURCE_PLL4R:
    case LL_RCC_ADC2_CLKSOURCE_PLL4R:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        adc_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    case LL_RCC_ADC1_CLKSOURCE_PER:
    case LL_RCC_ADC2_CLKSOURCE_PER:
      adc_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    case LL_RCC_ADC1_CLKSOURCE_PLL3Q:
    case LL_RCC_ADC2_CLKSOURCE_PLL3Q:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        adc_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

