zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_rcc.c
  return adc_frequency;
}

/**
  * @brief  Return LPTIMx clock frequency
  * @param  LPTIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE
  * @retval LPTIM clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetLPTIMClockFreq(uint32_t LPTIMxSource)
{
  uint32_t lptim_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_LPTIM_CLKSOURCE(LPTIMxSource));

  switch (LL_RCC_GetLPTIMClockSource(LPTIMxSource))
  {
    case  LL_RCC_LPTIM1_CLKSOURCE_PCLK1:
      lptim_frequency = RCC_GetPCLK1ClockFreq(RCC_GetMLHCLKClockFreq(RCC_GetMLAHBSClockFreq()));
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_PLL4P:
    case LL_RCC_LPTIM45_CLKSOURCE_PLL4P:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        lptim_frequency = PLL_Clocks.PLL_P_Frequency;
      }
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_PLL3Q:
    case LL_RCC_LPTIM45_CLKSOURCE_PLL3Q:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        lptim_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_LSE:
    case LL_RCC_LPTIM2_CLKSOURCE_LSE:
    case LL_RCC_LPTIM3_CLKSOURCE_LSE:
    case LL_RCC_LPTIM45_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        lptim_frequency = LSE_VALUE;
      }
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_LSI:
    case LL_RCC_LPTIM2_CLKSOURCE_LSI:
    case LL_RCC_LPTIM3_CLKSOURCE_LSI:
    case LL_RCC_LPTIM45_CLKSOURCE_LSI:
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        lptim_frequency = LSI_VALUE;
      }
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_PER:
    case LL_RCC_LPTIM2_CLKSOURCE_PER:
    case LL_RCC_LPTIM3_CLKSOURCE_PER:
    case LL_RCC_LPTIM45_CLKSOURCE_PER:
      lptim_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    case LL_RCC_LPTIM2_CLKSOURCE_PCLK3:
    case LL_RCC_LPTIM3_CLKSOURCE_PCLK3:
    case LL_RCC_LPTIM45_CLKSOURCE_PCLK3:
      lptim_frequency = RCC_GetPCLK3ClockFreq(RCC_GetMLHCLKClockFreq(RCC_GetMLAHBSClockFreq()));
      break;

    case LL_RCC_LPTIM2_CLKSOURCE_PLL4Q:
    case LL_RCC_LPTIM3_CLKSOURCE_PLL4Q:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        lptim_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    case LL_RCC_LPTIM1_CLKSOURCE_OFF:
    case LL_RCC_LPTIM2_CLKSOURCE_OFF:
    case LL_RCC_LPTIM3_CLKSOURCE_OFF:
    case LL_RCC_LPTIM45_CLKSOURCE_OFF:
    default:
      /* Do Nothing */
      break;
  }

  return lptim_frequency;
}

/**
  * @brief  Return DFSDM kernel clock frequency
  * @param  DFSDMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DFSDM_CLKSOURCE
  * @note   DFSM shares with SAI1 the same kernel clock source
  * @retval DFSDM clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetDFSDMClockFreq(uint32_t DFSDMxSource)
{
  uint32_t dfsdm_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_DFSDM_CLKSOURCE(DFSDMxSource));

  switch (LL_RCC_GetSAIClockSource(LL_RCC_SAI1_CLKSOURCE))
  {
    case LL_RCC_SAI1_CLKSOURCE_PLL4Q:
      if (LL_RCC_PLL4_IsReady() != 0U)
      {
        LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
        dfsdm_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    case LL_RCC_SAI1_CLKSOURCE_PLL3Q:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        dfsdm_frequency = PLL_Clocks.PLL_Q_Frequency;
      }
      break;

    case LL_RCC_SAI1_CLKSOURCE_I2SCKIN:
      dfsdm_frequency = EXTERNAL_CLOCK_VALUE;
      break;

    case LL_RCC_SAI1_CLKSOURCE_PER:
      dfsdm_frequency = LL_RCC_GetCKPERClockFreq(LL_RCC_CKPER_CLKSOURCE);
      break;

    case LL_RCC_SAI1_CLKSOURCE_PLL3R:
      if (LL_RCC_PLL3_IsReady() != 0U)
      {
        LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
        dfsdm_frequency = PLL_Clocks.PLL_R_Frequency;
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

  return dfsdm_frequency;
}

/**
  * @brief  Return LTDC kernel clock frequency
  * @retval LTDC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetLTDCClockFreq(void)
{
  uint32_t ltdc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  if (LL_RCC_PLL4_IsReady() != 0U)
  {
    LL_RCC_GetPLL4ClockFreq(&PLL_Clocks);
    ltdc_frequency = PLL_Clocks.PLL_Q_Frequency;
  }

  return ltdc_frequency;
}

/**
  * @brief  Return RTC clock frequency
  * @retval RTC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetRTCClockFreq(void)
{
  uint32_t rtc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* RTCCLK clock frequency */
  switch (LL_RCC_GetRTCClockSource())
  {
    case LL_RCC_RTC_CLKSOURCE_LSE:     /* LSE clock used as RTC clock source */
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        rtc_frequency = LSE_VALUE;
      }
      break;

    case LL_RCC_RTC_CLKSOURCE_LSI:     /* LSI clock used as RTC clock source */
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        rtc_frequency = LSI_VALUE;
      }
      break;

    case LL_RCC_RTC_CLKSOURCE_HSE_DIV: /* HSE clock used as RTC clock source */
      rtc_frequency = (HSE_VALUE / (LL_RCC_GetRTC_HSEPrescaler() + 1U));
      break;

    case LL_RCC_RTC_CLKSOURCE_NONE:    /* No clock used as RTC clock source */
    default:
      /* Do Nothing */
      break;
  }

  return rtc_frequency;
}

/**
  * @brief  Return TIMGx clock frequency
  * @param  TIMGxPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIMG1PRES
  *         @arg @ref LL_RCC_TIMG2PRES
  *         @arg @ref LL_RCC_TIMG3PRES
  *@note    LL_RCC_TIMG1PRES returns the frequency of the prescaler of timers
  *         located into APB1 domain. It concerns TIM2, TIM3, TIM4, TIM5, TIM6,
  *         and TIM7.
  *         LL_RCC_TIMG2PRES returns the frequency of the prescaler of timers
  *         located into APB2 domain. It concerns TIM1, TIM8.
  *         LL_RCC_TIMG3PRES returns the frequency of the prescaler of timers
  *         located into APB6 domain. It concerns TIM12, TIM13, TIM14, TIM15,
  *         TIM16 and TIM17.
  * @retval TIMGx clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetTIMGClockFreq(uint32_t TIMGxPrescaler)
{
  uint32_t timg_frequency;
  uint32_t apb1_div;
  uint32_t apb2_div;
  uint32_t apb6_div;

  /* Check parameter */
  assert_param(IS_LL_RCC_TIMGPRES(TIMGxPrescaler));

  timg_frequency = RCC_GetMLHCLKClockFreq(RCC_GetMLAHBSClockFreq());
  apb1_div = LL_RCC_GetAPB1Prescaler();
  apb2_div = LL_RCC_GetAPB2Prescaler();
  apb6_div = LL_RCC_GetAPB6Prescaler();

  switch (LL_RCC_GetTIMGPrescaler(TIMGxPrescaler))
  {
    case LL_RCC_TIMG1PRES_ACTIVATED:
      switch (apb1_div)
      {
        case LL_RCC_APB1_DIV_1:
        case LL_RCC_APB1_DIV_2:
        case LL_RCC_APB1_DIV_4:
          break;
        case LL_RCC_APB1_DIV_8:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB1_DIV_16:
          timg_frequency /= 4U;
          break;
        default:
          /* Do Nothing */
          break;
      }
      break;
    case LL_RCC_TIMG2PRES_ACTIVATED:
      switch (apb2_div)
      {
        case LL_RCC_APB2_DIV_1:
        case LL_RCC_APB2_DIV_2:
        case LL_RCC_APB2_DIV_4:
          break;
        case LL_RCC_APB2_DIV_8:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB2_DIV_16:
          timg_frequency /= 4U;
          break;
        default:
          /* Do Nothing */
          break;
      }
      break;
    case LL_RCC_TIMG3PRES_ACTIVATED:
      switch (apb6_div)
      {
        case LL_RCC_APB6_DIV_1:
        case LL_RCC_APB6_DIV_2:
        case LL_RCC_APB6_DIV_4:
          break;
        case LL_RCC_APB6_DIV_8:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB6_DIV_16:
          timg_frequency /= 4U;
          break;
        default:
          /* Do Nothing */
          break;
      }
      break;

    case LL_RCC_TIMG1PRES_DEACTIVATED:
      switch (apb1_div)
      {
        case LL_RCC_APB1_DIV_1:
        case LL_RCC_APB1_DIV_2:
          break;
        case LL_RCC_APB1_DIV_4:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB1_DIV_8:
          timg_frequency /= 4U;
          break;
        case LL_RCC_APB1_DIV_16:
          timg_frequency /= 8U;
          break;
        default:
          /* Do Nothing */
          break;
      }
      break;
    case LL_RCC_TIMG2PRES_DEACTIVATED:
      switch (apb2_div)
      {
        case LL_RCC_APB2_DIV_1:
        case LL_RCC_APB2_DIV_2:
          break;
        case LL_RCC_APB2_DIV_4:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB2_DIV_8:
          timg_frequency /= 4U;
          break;
        case LL_RCC_APB2_DIV_16:
          timg_frequency /= 8U;
          break;
        default:
          /* Do Nothing */
          break;
      }
      break;
    case LL_RCC_TIMG3PRES_DEACTIVATED:
      switch (apb6_div)
      {
        case LL_RCC_APB6_DIV_1:
        case LL_RCC_APB6_DIV_2:
          break;
        case LL_RCC_APB6_DIV_4:
          timg_frequency /= 2U;
          break;
        case LL_RCC_APB6_DIV_8:
          timg_frequency /= 4U;
          break;
        case LL_RCC_APB6_DIV_16:
          timg_frequency /= 8U;
          break;
        default:
          /* Do Nothing */
          break;
      }
      break;

    default:
      timg_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
      break;
  }

