zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_rcc.c
  return timg_frequency;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup RCC_LL_Private_Functions
  * @{
  */

/**
  * @brief  Return MPUSS clock frequency
  * @retval MPUSS clock frequency (in Hz)
  */
uint32_t RCC_GetMPUSSClockFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t mpudiv;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Get MPUSS source -------------------------------------------------------*/
  switch (LL_RCC_GetMPUClkSource())
  {
    case LL_RCC_MPU_CLKSOURCE_HSI:
      frequency = (HSI_VALUE >> LL_RCC_HSI_GetDivider());
      break;

    case LL_RCC_MPU_CLKSOURCE_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_MPU_CLKSOURCE_PLL1:
      LL_RCC_GetPLL1ClockFreq(&PLL_Clocks);
      frequency = PLL_Clocks.PLL_P_Frequency;
      break;

    case LL_RCC_MPU_CLKSOURCE_MPUDIV:
      mpudiv = LL_RCC_GetMPUPrescaler();
      if (mpudiv != LL_RCC_MPU_DIV_OFF)
      {
        LL_RCC_GetPLL1ClockFreq(&PLL_Clocks);
        frequency = (PLL_Clocks.PLL_P_Frequency >> mpudiv);
      }
      break;

    default:
      /* Do Nothing */
      break;
  }

  return frequency;
}

/**
  * @brief  Return AXISS clock frequency
  * @retval AXISS clock frequency (in Hz)
  */
uint32_t RCC_GetAXISSClockFreq(void)
{
  uint32_t frequency = 0U;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Get AXISS source -------------------------------------------------------*/
  switch (LL_RCC_GetAXISSClkSource())
  {
    case LL_RCC_AXISS_CLKSOURCE_HSI:
      frequency = (HSI_VALUE >> LL_RCC_HSI_GetDivider());
      break;

    case LL_RCC_AXISS_CLKSOURCE_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_AXISS_CLKSOURCE_PLL2:
      LL_RCC_GetPLL2ClockFreq(&PLL_Clocks);
      frequency = PLL_Clocks.PLL_P_Frequency;
      break;

    case LL_RCC_AXISS_CLKSOURCE_OFF:
    default:
      /* Do Nothing */
      break;
  }

  return frequency;
}

/**
  * @brief  Return MLAHBS clock frequency
  * @retval MLAHBS clock frequency (in Hz)
  */
uint32_t RCC_GetMLAHBSClockFreq()
{
  uint32_t frequency = 0U;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Get MLAHBS source -------------------------------------------------------*/
  switch (LL_RCC_GetMLAHBSClkSource())
  {
    case LL_RCC_MLAHBS_CLKSOURCE_HSI:
      frequency = (HSI_VALUE >> LL_RCC_HSI_GetDivider());
      break;

    case LL_RCC_MLAHBS_CLKSOURCE_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_MLAHBS_CLKSOURCE_CSI:
      frequency = CSI_VALUE;
      break;

    case LL_RCC_MLAHBS_CLKSOURCE_PLL3:
      LL_RCC_GetPLL3ClockFreq(&PLL_Clocks);
      frequency = PLL_Clocks.PLL_P_Frequency;
      break;

    default:
      /* Do Nothing */
      break;
  }

  return frequency;
}

/**
  * @brief  Return ACLK (ACLK, HCLK5 and HCLK6) clock frequency
  * @retval ACLK clock frequency (in Hz)
  */
uint32_t RCC_GetACLKClockFreq(uint32_t AXISS_Frequency)
{
  return LL_RCC_CALC_ACLK_FREQ(AXISS_Frequency, LL_RCC_GetACLKPrescaler());
}

/**
  * @brief  Return MLHCLK (MLHCLK, HCLK[4:1], MCU_CK and FCLK_CK) clock frequency
  * @retval MLHCLK clock frequency (in Hz)
  */
uint32_t RCC_GetMLHCLKClockFreq(uint32_t MLAHBS_Frequency)
{
  return LL_RCC_CALC_MLHCLK_FREQ(MLAHBS_Frequency, LL_RCC_GetMLHCLKPrescaler());
}

/**
  * @brief  Return PCLK1 clock frequency
  * @param  MLHCLK_Frequency MLHCLK clock frequency
  * @retval PCLK1 clock frequency (in Hz)
  */
uint32_t RCC_GetPCLK1ClockFreq(uint32_t MLHCLK_Frequency)
{
  /* PCLK1 clock frequency */
  return LL_RCC_CALC_PCLK1_FREQ(MLHCLK_Frequency, LL_RCC_GetAPB1Prescaler());
}

/**
  * @brief  Return PCLK2 clock frequency
  * @param  MLHCLK_Frequency MLHCLK clock frequency
  * @retval PCLK2 clock frequency (in Hz)
  */
uint32_t RCC_GetPCLK2ClockFreq(uint32_t MLHCLK_Frequency)
{
  /* PCLK2 clock frequency */
  return LL_RCC_CALC_PCLK2_FREQ(MLHCLK_Frequency, LL_RCC_GetAPB2Prescaler());
}

/**
  * @brief  Return PCLK3 clock frequency
  * @param  MLHCLK_Frequency MLHCLK clock frequency
  * @retval PCLK3 clock frequency (in Hz)
  */
uint32_t RCC_GetPCLK3ClockFreq(uint32_t MLHCLK_Frequency)
{
  /* PCLK3 clock frequency */
  return LL_RCC_CALC_PCLK3_FREQ(MLHCLK_Frequency, LL_RCC_GetAPB3Prescaler());
}

/**
  * @brief  Return PCLK4 clock frequency
  * @param  ACLK_Frequency ACLK clock frequency
  * @retval PCLK4 clock frequency (in Hz)
  */
uint32_t RCC_GetPCLK4ClockFreq(uint32_t ACLK_Frequency)
{
  /* PCLK4 clock frequency */
  return LL_RCC_CALC_PCLK4_FREQ(ACLK_Frequency, LL_RCC_GetAPB4Prescaler());
}

/**
  * @brief  Return PCLK5 clock frequency
  * @param  ACLK_Frequency ACLK clock frequency
  * @retval PCLK5 clock frequency (in Hz)
  */
uint32_t RCC_GetPCLK5ClockFreq(uint32_t ACLK_Frequency)
{
  /* PCLK5 clock frequency */
  return LL_RCC_CALC_PCLK5_FREQ(ACLK_Frequency, LL_RCC_GetAPB5Prescaler());
}

/**
  * @brief  Return PCLK6 clock frequency
  * @param  ACLK_Frequency ACLK clock frequency
  * @retval PCLK6 clock frequency (in Hz)
  */
uint32_t RCC_GetPCLK6ClockFreq(uint32_t ACLK_Frequency)
{
  /* PCLK6 clock frequency */
  return LL_RCC_CALC_PCLK6_FREQ(ACLK_Frequency, LL_RCC_GetAPB6Prescaler());
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */
